Tekla Open API Reference for Tekla Structures 2025
ControlPlane Constructor (Plane, Boolean)
 Creates a new control plane instance taking the plane and magnetism as input.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlPlane(
	Plane P,
	bool IsMagnetic
)
Public Sub New (
	P As Plane,
	IsMagnetic As Boolean
)
Parameters
P
Type: Tekla.Structures.Model.Plane
The plane to be used.
IsMagnetic
Type: System.Boolean
Determines whether the plane is magnetic or not.
See Also
Reference
ControlPlane Class
ControlPlane Overload
Tekla.Structures.Model Namespace